# SQL Practice

#### World Database

In [ ]:
# What languages are spoken in Santa Monica?
'''
select Language, Percentage
from city
join countrylanguage on countrylanguage.countrycode = city.countrycode
where countrylanguage.CountryCode = 'USA' and city.Name = 'Santa Monica'
order by Percentage asc
;
'''

In [ ]:
# How many different countries are in each region?
'''
select Region, Count(Region) as num_countries
from country
Group by Region
Order by num_countries asc
;
'''

In [ ]:
# What is the population for each region?
'''
select Region, sum(Population) as population
from country
Group by Region
Order by population desc
;
'''

In [ ]:
# What is the population for each continent?
'''
select Continent, Sum(Population) as Population 
from country
group by Continent
order by Population desc;
'''

In [ ]:
# What is the average life expectancy globally?
'''
select avg(LifeExpectancy) as LifeExpectancy 
from country
;
'''

In [ ]:
# What is the average life expectancy for each region, each continent? Sort the results from shortest to longest
'''
select Continent, avg(LifeExpectancy) as LifeExpectancy 
from country
group by Continent
order by LifeExpectancy asc
;

select Region, avg(LifeExpectancy) as LifeExpectancy 
from country
group by Region
order by LifeExpectancy asc
;
'''

In [ ]:
# Find all the countries whose local name is different from the official name
'''
select c.Name, c.LocalName
from country as c
where c.Name != c.LocalName 
;
'''

In [ ]:
# How many countries have a life expectancy less than x?
'''
select c.Name, c.LifeExpectancy, c.Continent
from country as c 
where c.LifeExpectancy <= 50
order by LifeExpectancy asc
;
'''

In [ ]:
# What is the city name, district, county, region, and content of each city in the database?
'''
select city.name as City_Name, District, c.Name as Country, Region, Continent 
from city
join country as c on c.Code = city.CountryCode;
'''

In [ ]:
# What is the life expectancy in city x?
'''
select city.name as City_Name, LifeExpectancy 
from city
join country as c on c.Code = city.CountryCode;
'''

#### Sakila Database

In [ ]:
# Display the first and last names in all lowercase of all the actors.

'''
SELECT lower(first_name), lower(last_name)
FROM actor;
'''

In [ ]:
# You need to find the ID number, first name, and last name of an actor, of whom you know only the first name, 
#"Joe." What is one query would you could use to obtain this information?

'''
SELECT actor_id, first_name, last_name
FROM actor
WHERE first_name LIKE '%Joe';
'''

In [ ]:
# Find all actors whose last name contain the letters "gen":

'''
SELECT actor_id, first_name, last_name
FROM actor
WHERE last_name LIKE '%gen%';
'''

In [ ]:
# Find all actors whose last names contain the letters "li". 
# This time, order the rows by last name and first name, in that order.
'''
SELECT actor_id, first_name, last_name
FROM actor
WHERE last_name LIKE '%li%'
Order by last_name, first_name;
'''

In [ ]:
# Using IN, display the country_id and country columns for the following countries: 
# Afghanistan, Bangladesh, and China:
'''
SELECT country_id, country
FROM country
WHERE country in ('Afghanistan', 'Bangladesh','China');
'''

In [ ]:
# List the last names of all the actors, as well as how many actors have that last name.
'''
SELECT last_name, count(last_name)
FROM actor
group by last_name
;
'''

In [ ]:
# List last names of actors and the number of actors who have that last name, 
# but only for names that are shared by at least two actors
'''
SELECT last_name, count(last_name) as count 
FROM actor
GROUP BY last_name
HAVING COUNT(last_name)>=2
;
'''

In [ ]:
# You cannot locate the schema of the address table. Which query would you use to re-create it?
'''
create table address_new (
    address_id integer(11) NOT NULL,
    address varchar(30) NOT NULL,
    adress2 varchar(30) NOT NULL,
    district varchar(30) NOT NULL,
    city_id integer(11) NOT NULL,
    postal_code integer(11) NOT NULL,
    phone integer(10) NOT NULL,
    location varchar(30) NOT NULL,
    last_update datetime);

'''

In [ ]:
# Use JOIN to display the first and last names, as well as the address, of each staff member.
'''
select staff.first_name, staff.last_name, address.address
from staff
join address on address.address_id = staff.address_id
;
'''

In [ ]:
# Use JOIN to display the total amount rung up by each staff member in August of 2005.
'''
select first_name, last_name, count(payment.amount) as total_rung_up
from staff
join payment on payment.staff_id = staff.staff_id
Where month(payment.payment_date) = 8
group by payment.staff_id
;
'''

In [ ]:
# List each film and the number of actors who are listed for that film.
'''
select f.title, count(fa.actor_id) as actor_count
from film as f
join film_actor as fa where fa.film_id = f.film_id
group by f.title
;
'''

In [ ]:
# How many copies of the film Hunchback Impossible exist in the inventory system?
'''
Select ft.title, count(i.film_id) as current_inventory
from film_text as ft
Join inventory as i on i.film_id = ft.film_id
where ft.title like '%Hunchback Impossible'
group by ft.title
;
'''

In [ ]:
# The music of Queen and Kris Kristofferson have seen an unlikely resurgence. 
# As an unintended consequence, films starting with the letters K and Q have also soared in popularity. 
# Use subqueries to display the titles of movies starting with the letters K and Q whose language is English.
'''
Select f.title, f.description
from film as f
Where f.title like 'K%' or f.title like 'Q%' and f.language_id = 1
;
'''

In [ ]:
# Use subqueries to display all actors who appear in the film Alone Trip.
'''
Select f.title, concat(a.first_name,' ', a.last_name) as Actor_name
from film as f
join film_actor as fa on fa.film_id = f.film_id
join actor as a on a.actor_id = fa.actor_id
Where f.title like '%Alone Trip'
;
'''

In [ ]:
# You want to run an email marketing campaign in Canada, for which you will need the names 
# and email addresses of all Canadian customers.
'''
Select cu.first_name, cu.last_name, email, address, ci.city, postal_code, cu.last_update
from customer as cu
Join address as a on a.address_id = cu.address_id
join city as ci on ci.city_id = a.city_id
join country as co on co.country_id = ci.country_id
where co.country_id = 20
;
'''

In [ ]:
# Sales have been lagging among young families, and you wish to target all family movies for a promotion. 
# Identify all movies categorized as famiy films.
'''
Select *
from film as f
join film_category as fc on fc.film_id = f.film_id
Where fc.category_id = 8
;
'''

In [ ]:
# Write a query to display how much business, in dollars, each store brought in.
'''
select s.store_id, concat ('$', ' ', sum(s.store_id)) as profit
from staff as s
join payment as p on p.staff_id = s.staff_id
group by s.store_id
;
'''

In [ ]:
# Write a query to display for each store its store ID, city, and country.
'''
select store_id, a.address, c.city, cc.country
from store as s
join address as a on a.address_id = s.address_id
join city as c on c.city_id = a.city_id
join country as cc on cc.country_id = c.country_id
;
'''

In [ ]:
# List the top five genres in gross revenue in descending order. 
# (Hint: you may need to use the following tables: category, film_category, inventory, payment, and rental.)
'''
SELECT cat.name as category, SUM(d.revenue) as revenue from category cat 
JOIN
    (SELECT catf.category_id, c.revenue FROM film_category catf 
	JOIN 
		(SELECT i.film_id, b.revenue FROM inventory i 
		JOIN 
			(SELECT r.inventory_id, a.revenue from rental r 
			JOIN 
				(SELECT p.rental_id, p.amount as revenue FROM payment p) a 
				ON a.rental_id = r.rental_id) b
			ON b.inventory_id = i.inventory_id) c
		ON c.film_id = catf.film_id) d 
	ON d.category_id = cat.category_id GROUP BY cat.name
  ORDER BY revenue DESC
  LIMIT 5;  
'''

#### Sakila w/ Select Statements

In [ ]:
# SELECT statements

# Select all columns from the actor table.
'''
select *
from actor
;
'''
# Select only the last_name column from the actor table.
'''
select last_name
from actor
;
'''

In [ ]:
# DISTINCT operator

# Select all distinct (different) last names from the actor table.
'''
select distinct last_name
from actor
;
'''
# Select all distinct (different) postal codes from the address table.
'''
select distinct postal_code
from address
;
'''
# Select all distinct (different) ratings from the film table.
'''
select distinct rating
from film
;
'''

In [ ]:
# WHERE clause

#Select the title, description, rating, movie length columns from the films table that last 3 hours or longer.
 '''
select title, description, rating, length
from film
where length >= 180
;
 '''
# Select the payment id, amount, and payment date columns from the payments table for payments 
# made on or after 05/27/2005.
'''
select payment_id, amount, payment_date
from payment
where payment_date >= '2005-05-27'
;
'''    
# Select the primary key, amount, and payment date columns from the payment table for payments made on 05/27/2005.
'''
select payment_id, amount, payment_date
from payment
where payment_date like '%2005-05-27%'
order by payment_date
;
'''
# Select all columns from the customer table for rows that have a last names beginning with S 
# and a first names ending with N.
'''
select *
from customer
where last_name like 'S%' and first_name like '%N'
;
'''
# Select all columns from the customer table for rows where the customer is inactive or has 
# a last name beginning with "M".
'''
select *
from customer
where active = 0 
or last_name like 'M%'
order by active
;
'''
# Select all columns from the category table for rows where the primary key is greater than 4 and 
# the name field begins with either C, S or T.
'''
select *
from category
where category_id > 4
and name like '%C'
or name like '%S'
or name like '%T'
;
'''
# Select all columns minus the password column from the staff table for rows that contain a password.
'''
select staff_id, first_name, last_name, address_id, picture, email, store_id, active, username
from staff
where staff_id = 1
;
'''
# Select all columns minus the password column from the staff table for rows that do not contain a password.
'''
select staff_id, first_name, last_name, address_id, picture, email, store_id, active, username
from staff
where staff_id = 2
;
'''